iskandinav_mitolojisi/app/Models/PanelModel.php

DELETE FROM `tanrilar`
WHERE `id` = '11'
---
    public function kayit_sil($id)
    {
        $builder =$this->db->table('tanrilar');
        $builder->where('id',$id);
        return $builder->delete();